In [29]:
import glob
from bs4 import BeautifulSoup
import csv
import pandas as pd

all_files = glob.glob("./data/*.html")

In [28]:
header = []
data = []
for file in all_files:
    song_soup = BeautifulSoup(open(file),"html.parser")

    for row in song_soup.find_all('tr'):
        th = row.find_all('th')
        new_row=[]
        if th:
            if len(header)==0:
                for _th in th:
                    if len(_th.contents) ==3:
                        header.append(_th.contents[0]+" "+_th.contents[2])
                    else:
                        header.append(_th.contents[0])
        else:
            td = row.find_all('td')
            if td:
                if len(td)==6:
                    for _td in td:
                        a=_td.find_all('a')
                        if a:
                            for _a in a:
                                new_row.append(_a.contents[0])
                        else:
                            if len(_td.contents)>0:
                                new_row.append(_td.contents[0])
                            else:
                                new_row.append('')
        if len(new_row)==6:
            data.append(new_row)

with open('movies.csv', 'w', encoding='UTF8') as f:
    writer = csv.writer(f)

    # write the header
    writer.writerow(header)

    # write the data
    for _data in data:
        writer.writerow(_data)

In [31]:
df = pd.read_csv('movies.csv', ',')
df

,Release Date,Movie,Genre,Release Type,Revenue to Date,Trailer
0,January 4,Sorceress,Thriller/Suspense,Video,$0,
1,January 6,Houseguest,Comedy,Theatrical,"$26,325,256",
2,NaN,Showgirls,Drama,Theatrical,"$37,750,754",
3,January 11,Higher Learning,Drama,Theatrical,"$38,023,585",
4,January 13,Far from\r\n ...,Adventure,Theatrical,"$11,380,788",
...,...,...,...,...,...,...
308,NaN,The Way to Dusty\r\n ...,Action,Unknown,$0,
309,NaN,Zooman,Action,Unknown,$0,
310,NaN,Terra\r\n ...,Drama,Theatrical,"$6,869",
311,1995 TBD,The Great Mom Swap,Comedy,Video,$0,
312,NaN,Il mondo alla rovescia,NaN,Theatrical,$0,